Revit 2027 API
FabricationConfiguration.GetPartCustomDataType Method
 Gets the custom data type from its identifier. See FabricationCustomDataType enumerator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationCustomDataType GetPartCustomDataType(
	int customDataId
)
Public Function GetPartCustomDataType (
	customDataId As Integer
) As FabricationCustomDataType
public:
FabricationCustomDataType GetPartCustomDataType(
	int customDataId
)
member GetPartCustomDataType :
        customDataId : int -> FabricationCustomDataType
Parameters
customDataId Int32
 The custom data identifier.
Return Value
FabricationCustomDataType
 The custom data type.
Exceptions
Exception | Condition
ArgumentException |  The custom data does not exist.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace